


const ADefineLang={

    0:"{0}",

    31:'#####以下是常规操作#####',
    31101:'确定',
    31102:'取消',

    
    33:'#####以下是程序内文本内容#####',
    331001:'更新manage程序项目',
    331002:'升级本身程序',
    331003:'初始化项目',
    331004:'强制操作',
    331005:'更新go系列程序项目',
    331006:'运行go系列调试',

    34:"debug",
    3411001:"系统开始初始化",
    3411002:"执行init操作，目录地址为{0}",
    3411003:"开始执行manage更新操作",
    3411004:"执行go系列初始化操作",
    
    36:"info",
    3611001:"初始化go系列项目成功，请打开dev/settings/config.json文件进行配置",

    37:"warn",
    3711001:"已存在ts的目录配置,如果是强制操作请加-f 或者 --force 标记",
    3711002:"文件{0}，没找到源标记{1}",
    3711003:"文件{0}，没找到目标标记{1}",


    39:"error",
    3911001:"没有找到配置目录{0}，请先执行uhutu-ts --init=go 初始化项目",
    3911002:"配置项没有生成，请重新检查",
    3911003:"没有找到元素{0},请检查",
    99:''
}


export {ADefineLang};


