"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
var AdefineLang = {
    0: "{0}",
    31: '#####以下是常规操作#####',
    31101: '确定',
    31102: '取消',
    33: '#####以下是程序内文本内容#####',
    331001: '更新web程序项目',
    331002: '升级本身程序',
    331003: '初始化项目',
    331004: '强制操作',
    34: "debug",
    3411001: "系统开始初始化",
    3411002: "执行init操作，目录地址为{0}",
    3411003: "开始执行web更新操作",
    36: "info",
    37: "warn",
    3711001: "已存在ts的目录配置,如果是强制操作请加-f 或者 --force 标记",
    3711002: "内容替换时，在目标内容中没找到正则{0}对应的内容",
    39: "error",
    3911001: "没有找到配置目录{0}，请先执行uhutu-ts --init 初始化项目",
    99: ''
};
exports.AdefineLang = AdefineLang;
